opensoap/samples/ShoppingSec/SampleMessages/GetProductSpecReqF1.xml

<?xml version="1.0"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
    <SOAP-ENV:Body>
        <m:GetProduct xmlns:m="http://services.opensoap.jp/samples/Shopping/">
            <index>10</index>
        </m:GetProduct>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
